pabG = (
    (10829670737591616881, 5654694684284925384, 8813703413191082292),
    (1641649954652386070, 6138061874724201376, 1),
)
pk = (5002204260689444003, 4864358965035087900, 1)
ct = (
    (51088427393127044, 4878776382292322395, 1),
    (10781379197071597919, 6012831518044176787, 1),
)
pt = [0, 0]
pt[0] = ct[1][0] - pk[0] * (ct[0][0] / pabG[1][0])
pt[1] = ct[1][1] - pk[1] * (ct[0][1] / pabG[1][1])
# print(ct[1][0])
print(ct[0][0] / pabG[1][0])
print(ct[0][1] / pabG[1][1])
print("The FLAG is NeSE{" + str(pt[0]) + str(pt[1]) + "}")


# 问题：射影平面上的坐标运算该如何去做？
# 解密过程
# pt=pt+k*pk-(k*G/G)*pk


# sk = randrange(0, p)
# 私钥
# pk = sk * G
# 公钥

# pt = E.random_point()
# 明文
# k = randrange(0, p)

# ct = (k * G, pt + k * pk)
# 密文

# print((p, a, b), G)
# print(pk)
# print(ct)
# 打印密文
